In [ ]:
1	Read the excel file, orÂ copy the DataFrame.
2	How many rows and columns are there?
3	Read the first 4 rows
4	How many rows are there?
5	Display the columns of the DataFrame
6	Display the first 5 records of NAME column of the DataFrame
7	Display highest 5 records based on the MARK column.
8	Display all classes in CLASS column ( Unique class )
9	How to check the dimensions (rows and columns) of a DataFrame?
10	How to get a concise summary of the DataFrame, including column data types and missing values?
11	How to get the column names of a DataFrame?
12	How to get descriptive statistics of numeric columns in the DataFrame?
13	How to access the first few rows of a DataFrame?
14	How to filter rows based on a condition?
15	For example, filter rows where the "Mark" column is greater than 60.
16	How to select specific columns from a DataFrame?
17	For example, select only the "Name" and "Gender" columns.
18	How to sort the DataFrame based on a column?
19	How to add a new column to a DataFrame?
20	How to remove a column from a DataFrame?
21	How to group the DataFrame by a column and calculate summary statistics?
22	How to handle missing values in a DataFrame?
23	To check if there are any missing values:
24	To drop rows with missing values:
25	To fill missing values with a specific value:
26	How to access a specific row in a DataFrame based on its index?
27	How to filter rows based on multiple conditions?
28	For example, filter rows where the "class" column is Three and the "mark" column is More than 50.
29	How to calculate the total number of missing values in each column?
30	How to drop rows with missing values for specific columns? ( say Mark column )
31	How to apply a function to a column in a DataFrame? ( Add 5 mark for all )
32	How to merge/join two DataFrames based on a common column?
33	How to group the DataFrame by multiple columns and calculate summary statistics?
34	How to create a pivot table from a DataFrame?
35	How to rename columns in a DataFrame?
36	How to save a DataFrame to a CSV file?
37	How to calculate the maximum value in a specific column?
38	How to calculate the average value in a specific column?
39	How to calculate the average value in a specific column?
40	How to calculate the total sum of a specific column?
41	How to count the number of unique values in a column?
42	How to apply a function to multiple columns and create a new column based on the result? ( find out class rank based on mark )
43	How to drop duplicate rows from a DataFrame?
44	How to convert a column to a different data type?
45	How to apply a filter to a DataFrame based on a list of values?
46	How to reset the index of a DataFrame?
47	How to randomly select 7 rows (sample) from a DataFrame?
	
How to randomly select 7 rows (sample) from a DataFrame?

#You can read the file using the DataFrame structure

In [6]:
import pandas as pd

In [7]:
df = pd.read_csv("D:\path\student.csv")

In [8]:
print(df)

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

#How many rows and columns are there?

In [17]:
df.shape 
(35, 5)
#Here 35 is the row and 5 is the column, you can find them individually
# df.shape[0] #rows
# df.shape[1] #columns

(35, 5)

#Read the first 4 rows?

In [20]:
df.head() #This by default gives 5 values from top
# here we need the first 4 fours
df.head(4)

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female

#How many rows are there?

In [28]:
print(len(df))

35

#Display the columns of the DataFrame?

In [29]:
df.columns

Index(['id', 'name', 'class', 'mark', 'gender'], dtype='object')

#Display the first 5 records of NAME column of the DataFrame?

In [33]:
df[0:5] #displays the first 5 records
#to display the first 5 records of name 
df['name'][0:5]

0      John Deo
1      Max Ruin
2        Arnold
3    Krish Star
4     John Mike
Name: name, dtype: object

#Display highest 5 records based on the MARK column.

In [43]:
#This sorts all value from Mark

d = df.sort_values(['mark'], ascending= False)
print(d[:5])

    id       name  class  mark  gender
32  33  Kenn Rein    Six    96  female
11  12      Recky    Six    94  female
31  32  Binn Rott  Seven    90  female
10  11     Ronald    Six    89  female
24  25   Giff Tow  Seven    88    male

#Display all classes in CLASS column ( Unique class )

In [44]:
#This will give us class

df['class']

0      Four
1     Three
2     Three
3      Four
4      Four
5      Four
6     Fifth
7      Five
8       Six
9      Four
10      Six
11      Six
12    Seven
13    Seven
14     Four
15     Four
16      Six
17     Five
18     Nine
19     Nine
20     Four
21    Seven
22    Eight
23    Seven
24    Seven
25    Seven
26    Three
27    Seven
28    Seven
29      Six
30     Four
31    Seven
32      Six
33    Seven
34      Six
Name: class, dtype: object

In [49]:
#This gives us the unique class
(df['class'].unique())

array(['Four', 'Three', 'Fifth', 'Five', 'Six', 'Seven', 'Nine', 'Eight'],
      dtype=object)